/****************************************************************************
   +----------------------------------------------------------------------+
   | Copyright EDtech co.ltd 2002                                         |
   | EDtech co.ltd reserves the right to change products                  |
   | or specifications without notice.                                    |
   +----------------------------------------------------------------------+
   Project    : TFT LCD monitor & TV
   Version    : 
   File Name  : 
   Functions  : 
   Revision   :

   2003-04-11 2:45오후 by thkim          Modified for Monitor-TV
****************************************************************************/

//****************************************************************//
//화일참조
//****************************************************************//
#include	"TopHeader.h"
#include "extern.h"

#if !defined(NoOsdMenu)
//------------------------------------------------------------------------------------------------------------------
#if	defined(BtcBoard_Option)
//------------------------------------------------------------------------------------------------------------------

#include	"btc_osdmenu.h"	//2003-04-17

#include	"TVMODE.h"
#include	"BTC_230OSDdef.h"
#include	"EEPROMadr.h"
#include	"power.h"

#include "TW990X.H"
#include "eepromadr.h"
#include "tuner.h"
#if defined(INT_EXTOSD)
#include	"internalosd.h"
#endif

#if		defined(MCU_MTV230)
#include	"MTV230xfr.h"

		case MENU_OSD:    	return MenuNum= menu_language;     
		case MENU_PIP:    	return MenuNum= menu_pip_enable;   
		case MENU_TOOLS:  	return MenuNum= menu_auto_adjust;
		case MENU_SOUND:	return MenuNum= menu_Treble;	// smpark 20030708
	}
}

/*  for memory save 2003.6.5
BYTE GetMenuEnd(void)
{
	if(MenuNum<=TopMenuEnd) 	return TopMenuEnd;              
	if(MenuNum<=DisplayMenuEnd) 	return DisplayMenuEnd;        
	if(MenuNum<=RgbMenuEnd) 	return RgbMenuEnd; 
	if(MenuNum<=OsdMenuEnd) 	return menu_osd_transparency; 
	if(MenuNum<=PipMenuEnd) 	return PipMenuEnd;    
	if(MenuNum<=ToolsMenuEnd) 	return ToolsMenuEnd;  
}
*/

BYTE GetTopMenu(void)
{
	if(MenuNum<=TopMenuEnd) 	return MenuNum;
	if(MenuNum<=DisplayMenuEnd) 	return MENU_DISPLAY;
	if(MenuNum<=RgbMenuEnd) 	return MENU_RGB;
	if(MenuNum<=OsdMenuEnd) 	return MENU_OSD;
	if(MenuNum<=PipMenuEnd) 	return MENU_PIP;
	if(MenuNum<=ToolsMenuEnd) 	return MENU_TOOLS;
	if(MenuNum<=SoundMenuEnd)	return MENU_SOUND;	//smpark 20030708
	
}

/*  for memory save 2003.6.5

BYTE GetSubMenu(void)
{
	switch(MenuNum)
	{
		case MENU_DISPLAY:	return menu_brightness;   
		case MENU_RGB:    	return menu_white_balance;
		case MENU_OSD:    	return menu_language;     
		case MENU_PIP:    	return menu_pip_enable;   
		case MENU_TOOLS:  	return menu_auto_adjust;
	}
		//default:
		return GetTopMenu();
}
*/

	
	
/*  for memory save 2003.6.5                
BYTE GetTvMenuStart(BYTE mnum)
{
	if(mnum<=TvTopMenuEnd) 		return TVMENU_PICTURE;
	if(mnum<=TvPictureEnd) 		return tvmenu_tint;                                                 
	if(mnum<=TvSetupEnd) 		return tvmenu_finetune;                                             
	if(mnum<=TvToolsEnd) 		return tvmenu_sleep;	                                        
}       	                
*/


BYTE GetTvMenuStart2(void)
{
	switch(TvMenuNum)
	{
		case TVMENU_PICTURE:    return TvMenuNum= tvmenu_brightness;
		case TVMENU_SETUP:    	return TvMenuNum= tvmenu_country;
		case TVMENU_TOOLS:    	return TvMenuNum= tvmenu_lang;//tvmenu_ttx;
		case TVMENU_SOUND:    	return TvMenuNum= tvmenu_Treble;
	}
}

/*  for memory save 2003.6.5
BYTE GetTvMenuEnd(void)
{  
	if(TvMenuNum<=TvTopMenuEnd) 	return TvTopMenuEnd;            
	if(TvMenuNum<=TvPictureEnd) 	return tvmenu_tint; 
	if(TvMenuNum<=TvSetupEnd) 	return tvmenu_finetune;
	if(TvMenuNum<=TvToolsEnd) 	return tvmenu_sleep;
}
*/


BYTE GetTvTopMenu(void)
{
	if(TvMenuNum<=TvTopMenuEnd) 	return TvMenuNum;
	if(TvMenuNum<=TvPictureEnd) 	return TVMENU_PICTURE; 
	if(TvMenuNum<=TvSetupEnd) 	return TVMENU_SETUP;
	if(TvMenuNum<=TvToolsEnd) 	return TVMENU_TOOLS;
	if(TvMenuNum<=TvSoundEnd) 	return TVMENU_SOUND;		// smpark 20030715
	
}
/*  for memory save 2003.6.5
BYTE GetTvSubMenu(void)
{
	switch(TvMenuNum)
	{
		case TVMENU_PICTURE:    return tvmenu_brightness;                                                 
		case TVMENU_SETUP:    	return tvmenu_country;                                             
		case TVMENU_TOOLS:    	return tvmenu_ttx;		
	}
		//default:
		return GetTvTopMenu();
}
                */
/* 
typedef struct {   
	BYTE ChEdit_CursorNum;
	BYTE ChEdit_ChNum;
	BYTE ChEdit_ChName[5];
	bit  ChEdit_SkipFlag;
} ChEdit_Info;
*/	 
//--------------------------------------------------------------------------------------------------
#if 0
typedef struct
{
	BYTE CursorWinROWSTART0;	//1
	BYTE CursorWinROWEND0;		//2
	BYTE CursorWinCOLSTART0;	//3
	BYTE CursorWinCOLEND0;		//4
	BYTE CursorWinColor0;		//5
	BYTE CursorAttROWSTART0;	//6
	BYTE CursorAttCOLSTART0;	//7
	BYTE CursorAttCOLEND0;		//8
	BYTE CursorAttColor0;		//9
	                                
	BYTE CursorWinROWSTART1;	//10
	BYTE CursorWinROWEND1;		//11
	BYTE CursorWinCOLSTART1;	//12
	BYTE CursorWinCOLEND1;  	//13
	BYTE CursorWinColor1;   	//14
	BYTE CursorAttROWSTART1;	//15
	BYTE CursorAttCOLSTART1;	//16
	BYTE CursorAttCOLEND1;  	//17
	BYTE CursorAttColor1;   	//18
}	CursorTable;


code CursorTable CursorList[]=
{
 {0,0,0,0,0,0,0,0,0,0,0,0}//0
 //analog main
,{WIN_SROW3,WIN_EROW3,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW3,CII_COL0,30,OSD_WHITE, WIN_SROW3,WIN_EROW3,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW3,CII_COL0,28,OSD_WHITE}
,{WIN_SROW3,WIN_EROW3,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW3,CII_COL0,30,OSD_WHITE, WIN_SROW3,WIN_EROW3,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW3,CII_COL0,28,OSD_WHITE}
,{WIN_SROW4,WIN_EROW4,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW4,CII_COL0,30,OSD_WHITE, WIN_SROW4,WIN_EROW4,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW4,CII_COL0,28,OSD_WHITE}
,{WIN_SROW5,WIN_EROW5,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW5,CII_COL0,30,OSD_WHITE, WIN_SROW5,WIN_EROW5,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW5,CII_COL0,28,OSD_WHITE}
,{WIN_SROW6,WIN_EROW6,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW6,CII_COL0,30,OSD_WHITE, WIN_SROW6,WIN_EROW6,WIN_COL0,WIN_COL25,OSD_BLUE,ATTR_ROW6,CII_COL0,28,OSD_WHITE}

//analog bright/contrast sub
